<template>
  <div id="tos-page" class="tos-page page-padding">
    <div class="tos-page__container">
      <div class="flex-divider flex-row flex--center">
        <v-img width="5rem" max-width="5rem" :src="icon"></v-img>
      </div>
      <header>『ノーブル』 サービス利用規約</header>

      <div class="tos-page__content" v-for="(text,key,index) in texts" :key="key">
        <div class="tos-page__title" v-text="`第${index+1}条 ${text.title}`"></div>
        <div class="tos-page__desc" v-html="text.desc"></div>
        <ul class="tos-page__list">
          <li class="tos-page__item" v-for="(item,index) in text.list" :key="index">
            <div class="tos-page__text" v-text="`${index+1}.  ${item}`"></div>
          </li>
        </ul>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  auth: false,
  data() {
    return {
      icon: "/icon.png",
      texts: {
        定義: {
          title: "定義",
          desc:
            "<p>本規約において使用する用語の意義は、次の各号の定める通りとします。</p>",
          list: [
            "「本サービス」とは",
            "「本サイト」,「本アプリ」",
            "「使用者」",
            "「投稿作品」",
            "「投稿コンテンツ」"
          ]
        },
        適用範囲: {
          title: "本規約 (適用範囲)",
          desc: "<p></p>",
          list: [
            "本サイトには、本利用規約及びその他の利用規約等において、本サービスの利用条件が規定されています。その他の利用規約等は名称の如何にかかわらず本利用規約の一部を構成するものとします。",
            "本利用規約の規定とその他の利用規約等の規定が異なる場合は、当該その他の利用規約等の規定が優先して適用されるものとします。"
          ]
        },
        変更: {
          title: "本利用規約の変更",
          desc: "<p></p>",
          list: [
            "変更後の利用規約は、弊社が別途定める場合を除いて、本サイト上に表示した時点より効力を生じるものとします。",
            "弊社は、弊社の判断により、本利用規約をいつでも任意の理由で変更することができるものとします。",
            "使用者が、本利用規約の変更の効力が生じた後に本サービスを利用する場合は、変更後の利用規約の全ての記載内容に同意したものとみなされます。"
          ]
        },
        アカウント登録: {
          title: "",
          desc: "<p></p>",
          list: []
        },
        個人情報: {
          title: "個人情報の取扱い",
          desc:
            "<p>弊社は、個人情報を<a href='/about/pp'>「プライバシーポリシー」</a>に基づき、適切に取り扱うものとします。</p>",
          list: []
        },
        禁止事項: {
          title: "",
          desc: "<p></p>",
          list: []
        },
        // 権利: {
        //   title: "",
        //   desc: "<p></p>",
        //   list: []
        // },
        作品: {
          title: "投稿作品及び投稿コンテンツ",
          desc: "<p></p>",
          list: [
            "本サービスを利用して投稿した作品及び投稿コンテンツの著作権、商標権、意匠権、特許権等の知的財産権及びその他の一切の法的権利は、弊社及び他の会社が本規約等に別途定める場合を除き、すべて作品及びコンテンツを投稿したご本人様が保有するものとします。",
            "弊社は、本規約等に別途定める契約のある投稿作品および投稿コンテンツを除き、すべての投稿作品および投稿コンテンツの内容について、責任を負わないものとし、他の利用者および第三者から異議、申立て、クレームその他の請求を受けた場合は、利用者が自己の責任と費用において処理、解決するものとします。",
            "利用者様は、本サービスを経由して投稿した作品及びコンテンツが、第三者の著作権、商標権、意匠権、特許権等の知的財産権及びプライバシー権、名誉権、肖像権等法令上または契約上の一切の権利を侵害しないことを保証します。弊社は、投稿作品及び投稿コンテンツの内容が本規約等に違反すると判断した場合、利用者様の許諾を得る必要なく、投稿作品及び投稿コンテンツの閲覧制限または削除を行うことができるものとします。",
            "利用者様は、本規約等に別途定めのある投稿作品および投稿コンテンツを除き、本サービスによってご自身が投稿した作品及びコンテンツが、本サービスを介して複製、上映、公衆送信、口述、展示、頒布、貸与、翻訳、翻案等（以下「利用」といいます）されることを許諾するものとします。ただし、この許諾には、本サービスの運営上必要な範囲を超えて利用者様の投稿作品を利用することを含みません。",
            "利用者様は、弊社が承認した場合を除いて、本サービスを営利目的で利用し、または営利活動の準備のために利用することはできません。",
            "利用者様は、営利目的及びその他の目的等関係なく、弊社を通じて、投稿した作品及びコンテンツの権利者様ご本(ほん)人から許可をもらわなければ、投稿作品及び投稿コンテンツを本サービス以外のいかなる場所で利用することができないものとします。",
            "出版社様等のお客様は、投稿作品及び投稿コンテンツの商業的利用を求める場合、弊社の専用窓口を通してお申し込みください。"
          ]
        },

        削除権限: {
          title: "弊社の削除権限",
          desc:
            "<p>弊社は、次に掲げる場合には、テキスト等の情報の違法性・規約違反の有無にかかわらず、関連するテキスト等の情報について、その全部もしくは一部の削除又は公開範囲の変更等の不利益な措置を行うことができるものとします。</p>",
          list: [
            "弊社が18歳未満の閲覧を制限していないページにおいて、18歳未満が閲覧するにふさわしくないと判断されるテキスト等の情報が投稿された場合。",
            "公的な機関又は専門家（国、地方公共団体、特定電気通信役務提供者の損害賠償責任の制限及び発信者情報の開示に関する法律のガイドラインに規定された信頼性確認団体、インターネット・ホットライン、弁護士等をいいます）から、テキスト等の情報について、違法、公序良俗違反又は他人の権利を侵害する等の指摘・意見表明があった場合。",
            "権利者と称する者から、テキスト等の情報が自分の権利を侵害する旨の申告があった場合。ただし、権利者と称する者から、権利者であることを合理的に判断できる資料を提示され、弊社にて慎重に検討した結果、権利者であると当グループが判断した場合に限る。",
            "投稿されたテキスト等の情報が第三者の著作権を侵害すると弊社が判断した場合。",
            "テキスト等の情報に関して弊社より行なわれた対応要請連絡に対し、対応が確認されない状態が一定期間継続した後、その状態が当サイトの不利益となると弊社が判断した場合。"
          ]
        },
        活動報酬: {
          title: "活動報酬について",
          desc: "<p></p>",
          list: [
            "活動報酬の申請は本サイト内に個人管理画面で定めた手続きに従って行うものとします。",
            "活動報酬申請確定時、申請した額に応じたクラウンコイン数が自動的にクラウンコイン所持数から引かれるものとします。",
            "活動報酬申請確定後、弊社より申請人である利用者様の創作活動正当性について、第7条と第5条に従い確認を取らせていただきます。 対象コンテンツのオリジナル性判断にあたり、弊社は最善の努力をいたしますが、対象コンテンツが完全にオリジナルであることを保証・責任を負うものではありません。",
            "創作活動正当性確定終了後、申請時に指定した精算方法により、精算額は申請日の翌月10日迄に支払われるものとします。",
            "活動報酬は利用者様が本サイトで展開する創作活動に対しての報酬であり、創作そのものに関わる権利は一切影響しないものとします。",
            "指定する精算方法が銀行振込の場合、振込手数料は利用者様負担とさせていただきます。",
            "活動報酬は指定した精算方法によって、利用者様ご自身による確定申告が必要となる場合があります。"
          ]
        },
        準拠法及: {
          title: "",
          desc: "<p></p>",
          list: []
        }
      }
    };
  }
};
</script>

<style lang="scss">
.tos-page {
  $self: &;
  header {
    font-size: 2.5rem;
    font-weight: bold;
    text-align: center;
    border-bottom: 1px solid grey;
    padding: 2rem;
    margin-bottom: 2rem;
  }
  &__container {
    padding: 3rem 20rem;
    // margin: 0 5rem;
    border-radius: 0.5rem;
    background-color: #f7fafc;
    color: #4c555a;
    a {
      color: $secondary;
    }
    #{$self}__content {
      #{$self}__title {
        font-size: 1.8rem;
        font-weight: bold;
        margin-bottom: 2rem;
      }
      #{$self}__desc {
        font-size: 1.6rem;
      }
      #{$self}__list {
        margin-top: 1rem;
        #{$self}__item {
          padding-left: 3rem;
          margin-bottom: 1rem;
        }
        #{$self}__text {
          font-size: 1.5rem;
        }
      }
    }
  }
}
</style>
